## Jeopardy Data Project

This is a very basic analysis of Jeopardy Questions. 

- This first half of the project is dedicated to data import and clean up
- Second half includes a search program and basic analysis

In [1]:
import pandas as pd

In [2]:
jeopardy = pd.read_csv('jeopardy.csv')
pd.set_option('display.max_colwidth', -1)
jeopardy.head(2)

<ipython-input-2-4de3b884fe1f>:2: FutureWarning: Passing a negative integer is deprecated in version 1.0 and will not be supported in future version. Instead, use None to not limit the column width.
  pd.set_option('display.max_colwidth', -1)

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe

In [3]:
jeopardy.columns

Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')

In [4]:
jeopardy.rename(columns=lambda x: x.strip(),inplace=True)

In [5]:
jeopardy.columns

Index(['Show Number', 'Air Date', 'Round', 'Category', 'Value', 'Question',
       'Answer'],
      dtype='object')

In [6]:
# Convert Values to Float
jeopardy.Value = jeopardy.Value.apply(lambda x: float(x[1:].replace(',','')) if x != "None" else 0)

In [7]:
def filter_data(data, words):
    '''This function will return questions that include specific words'''  
    filter = lambda x: all(word.lower() in x.lower() for word in words)
    return data.loc[data["Question"].apply(filter)]

What is the average question value if the question includes the word King:

In [8]:
filtered = filter_data(jeopardy, ["King"])
print(filtered["Value"].mean())

771.8833850722094

In [9]:
def get_answer_counts(data):
    """Function to find the unique answers of a set of data"""
    return data["Answer"].value_counts()

Which Kings is included in the most Questions

In [10]:
print(get_answer_counts(filtered).head(10))

Henry VIII     55
Solomon        35
Richard III    33
Louis XIV      31
David          30
Sweden         28
Norway         27
Charles I      19
Belgium        19
Tonga          18
Name: Answer, dtype: int64

### Most Common Categories and Highest Value Questions

In [11]:
jeopardy.groupby('Category')['Value'].count().sort_values(ascending=False).head(10)

Category
BEFORE & AFTER             547
SCIENCE                    519
LITERATURE                 496
AMERICAN HISTORY           418
POTPOURRI                  401
WORLD HISTORY              377
WORD ORIGINS               371
COLLEGES & UNIVERSITIES    351
HISTORY                    349
SPORTS                     342
Name: Value, dtype: int64

In [12]:
jeopardy.groupby('Category')['Value'].mean('Value').sort_values(ascending=False).head(10)

Category
PLUS 8                     4160.0
STATE GEMS                 4000.0
"A" SCIENCE CATEGORY       3900.0
REMEMBERING TED KENNEDY    3640.0
"A" IN MATH                3640.0
NAMES FROM THE GERMAN      3600.0
HUMPHREY BOGART MOVIES     3560.0
NUMERIC PLACES             3480.0
JUNEAU                     3360.0
ELEMENTAL CLUES            3280.0
Name: Value, dtype: float64

How much are questions about Sports worth?

In [13]:
sports = jeopardy[jeopardy.Category == 'SPORTS']
sports.groupby('Round').mean('Value').drop('Show Number',axis = 1)

                       Value
Round
Double Jeopardy!  876.543210
Final Jeopardy!   0.000000
Jeopardy!         324.505929